app/models/bus.rb

	def self.getStopInfo(stopId)
		url = "https://data.smartdublin.ie/cgi-bin/rtpi/realtimebusinformation?stopid=" + stopId + "&format=xml"
		doc = Nokogiri::XML(open(url).read)
		doc.remove_namespaces!
		buses = Array.new()

		doc.xpath("///result").each do |bus|
			tempBus = Bus.new
			tempBus.route = bus.xpath('route').text.to_s
			tempBus.destination = bus.xpath('destination').text.to_s
			tempBus.departureduetime = bus.xpath('departureduetime').text.to_s
			buses << tempBus
---
INSERT INTO "buses" ("route", "destination", "departureduetime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["route", "145"], ["destination", "Heuston Station"], ["departureduetime", "4"], ["created_at", "2018-09-05 12:28:46.192867"], ["updated_at", "2018-09-05 12:28:46.192867"]]